# Создайте несколько переменных разных типов. Проверьте к какому типу относятся созданные переменные.

a1 = 3
a2 = 1.2
a3 = "три"
a4 = [1, 2, 3, 4]
a5 = a1 // a2

print(type(a1))
print(type(a2))
print(type(a3))
print(type(a4))
print(type(a5))